tap "anchordotdev/tap"
tap "owenthereal/upterm"

# libraries
brew 'icu4c', link: true

# services
brew 'postgresql@15', restart_service: true, link: true
brew 'redis', restart_service: true, link: true

# utilities
brew 'anchor'
brew 'asdf'
brew 'gh'
brew 'git'
brew 'htop'
brew 'nvim'
brew 'upterm'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'icu4c'
