tap 'anchordotdev/tap'
tap 'riscv-software-src/riscv'
tap 'fastly/tap'

# libraries
brew 'icu4c', link: true
brew 'isl', link: true
brew 'libpq', link: false
brew 'libsodium', link: true
brew 'libyaml', link: true

# services
brew 'postgresql@17', restart_service: true, link: true
brew 'redis', restart_service: true, link: true

# utilities
brew 'acme.sh'
brew 'afl++'
brew 'anchor'
brew 'asciinema'
brew 'awscli'
brew 'bash'
brew 'binutils'
brew 'caddy'
brew 'certbot'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'fastly'
brew 'fish'
brew 'flyctl'
brew 'gh'
brew 'git'
brew 'gnuplot'
brew 'go'
brew 'gopls'
brew 'goreleaser'
brew 'htop'
brew 'http-server'
brew 'hugo'
brew 'hyperfine'
brew 'icu4c'
brew 'jj'
brew 'jq'
brew 'lld'
brew 'llvm'
brew 'mise'
brew 'mkcert'
brew 'mtr'
brew 'ninja'
brew 'nvim'
brew 'overmind'
brew 'pstree'
brew 'qemu'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'riscv-gnu-toolchain'
brew 'riscv-isa-sim'
brew 'riscv-pk'
brew 'riscv-tools'
brew 'riscv64-elf-binutils'
brew 'riscv64-elf-gcc'
brew 'riscv64-elf-gdb'
brew 'tailscale'
brew 'telnet'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yq'

cask 'gcloud-cli'
cask 'ngrok'
cask 'wireshark-app'

# fonts
cask 'font-martian-mono-nerd-font'
