{
<<<<<<< HEAD
  "avante.nvim": { "branch": "main" },
  "blink.cmp": { "branch": "main" },
  "codeactions-on-save.nvim": { "branch": "main" },
  "gruvbox.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "mason-lock.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
=======
  "blink.cmp": { "branch": "main" },
  "codeactions-on-save.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "gruvbox.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "mason-lock.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
>>>>>>> 59e1bc2 (config: add random changes)
  "neovim-undotree": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
<<<<<<< HEAD
  "telescope.nvim": { "branch": "master" },
  "zig.vim": { "branch": "master" }
=======
  "render-markdown.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "zig.vim": { "branch": "master" }
>>>>>>> 59e1bc2 (config: add random changes)
}
